Also tried the terraform example, and with that, pulling looks to be working (so definitely issue with the reproduction  go code);

Before:

```bash
docker run -it --rm -v ./testbuilder/:/testbuilder -w /testbuilder -v /var/run/docker.sock:/var/run/docker.sock --entrypoint /bin/sh hashicorp/terraform:latest

terraform init
# ....

terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # docker_image.my-image will be created
  + resource "docker_image" "my-image" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "my-image:latest"
      + repo_digest = (known after apply)

      + build {
          + cache_from     = []
          + context        = "/testbuilder"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (11 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
docker_image.my-image: Creating...
╷
│ Error: failed to read downloaded context: failed to load cache key: invalid response status 403
│
│
│
│   with docker_image.my-image,
│   on main.tf line 14, in resource "docker_image" "my-image":
│   14: resource "docker_image" "my-image" {
│
╵
```

After:

```bash
docker run -it --rm -v ./testbuilder/:/testbuilder -w /testbuilder -v /var/run/docker.sock:/var/run/docker.sock --entrypoint /bin/sh hashicorp/terraform:latest

terraform init
# ....

terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following
symbols:
  + create

Terraform will perform the following actions:

  # docker_image.my-image will be created
  + resource "docker_image" "my-image" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "my-image:latest"
      + repo_digest = (known after apply)

      + build {
          + cache_from     = []
          + context        = "/testbuilder"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (11 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
docker_image.my-image: Creating...
docker_image.my-image: Creation complete after 1s [id=sha256:31c6e14aad4d37002e20cf3a94e1659f081471b7807f5dfa99a4f372914ce407my-image:latest]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```
